app/controllers/followers_controller.rb

  def index
    @follows = Follow.where.not('follower_id', @user.id)
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 1]]