app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "img_url") VALUES (?, ?, ?, ?)  [["name", "Test"], ["created_at", 2017-03-09 08:23:05 UTC], ["updated_at", 2017-03-09 08:23:05 UTC], ["img_url", ""]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "img_url" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["img_url", "test.jpg"], ["updated_at", 2017-03-16 07:28:31 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)